// 这里将区块icon本地化
import * as React from 'react';

export default function Icon() {
    return (
        <svg
            fill="currentColor"
            preserveAspectRatio="xMidYMid meet"
            width={30}
            height={30}
            viewBox="0 0 1024 1024"
            style={{
                verticalAlign: 'middle',
            }}
        >
            <path
                d="M544 88.3616l320.2672 184.9072a64 64 0 0 1 32 55.424v369.8128a64 64 0 0 1-32 55.4256L544 938.8384a64 64 0 0 1-64 0L159.7328 753.9312a64 64 0 0 1-32-55.424V328.6928a64 64 0 0 1 32-55.4256L480 88.3616a64 64 0 0 1 64 0zM175.7328 346.1664v352.3392a16 16 0 0 0 8 13.856L488 888.032V526.4528l-312.2656-180.288z m672.5328-0.3152L536 526.1392v361.8912l304.2688-175.6688a16 16 0 0 0 8-13.856v-352.656zM504 129.9312l-303.4 175.168L511.728 484.728l311.4-179.7872L520 129.9328a16 16 0 0 0-16 0z"
                 p-id="1799"></path>
        </svg>
    );
}
